app/models/shortened_url.rb

SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "9kP47wpC8iSkIazg8a1Uwg"], ["LIMIT", 1]]
---
  def self.random_code
    short_url = nil
    loop do
      short_url = SecureRandom.urlsafe_base64
      break if !(ShortenedUrl.exists?(short_url: short_url))

INSERT INTO "shortened_urls" ("short_url", "long_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["short_url", "9kP47wpC8iSkIazg8a1Uwg"], ["long_url", "www.reddit.com"], ["user_id", 1], ["created_at", "2020-02-23 22:22:07.843853"], ["updated_at", "2020-02-23 22:22:07.843853"]]
---
  def self.create_for_user_and_long_url!(user, long_url)
    ShortenedUrl.create!(user_id: user.id, long_url: long_url, short_url: ShortenedUrl.random_code)