app/models/visit.rb

INSERT INTO "visits" ("user_id", "url_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 3], ["url_id", 8], ["created_at", "2020-02-23 22:29:25.218686"], ["updated_at", "2020-02-23 22:29:25.218686"]]
---
  def self.record_visit!(user, shortened_url)
    Visit.create!(user_id: user.id, url_id: shortened_url.id)